README.org
* This repository includes various OpenShift / Kubernetes examples

  It is mainly used in workshops regarding OpenShift and Kubernetes
  basics. Feel free to use the examples in this repository.

  |-----------------------------------------|
  | :exclamation: MIGHT EAT YOUR BELOVED CAT |
  |-----------------------------------------|

  Examples are implemented using

  - registry.redhat.io/ubi8/ubi:8.3
  - [[https://github.com/rhatservices/openshift-quarkus-example]]

  |--------------------------------------------------------------|
  | :exclamation: Some examples requires project admin privileges |
  |--------------------------------------------------------------|

** [[file:core-concepts/][Core concepts]]

   Includes basic examples like:

   - [[file:core-concepts/01_simple-pod/][Creating simple pods]]
   - [[file:core-concepts/02_projects_namespaces/][Projects and namespaces]]
   - [[file:core-concepts/03_configmaps-secrets/][Configmaps and secrets]]
   - [[file:core-concepts/04_deployments/][Working with deployments]]
   - [[file:core-concepts/05_services_routes/][Services and routes]]
   - [[file:core-concepts/06_labels/][Working with labels]]
   - [[file:core-concepts/07_probes/][Liveness and readyness probes]]
   - [[file:core-concepts/08_limits_quotas/][Limits and quotas]]
   - [[file:core-concepts/09_pod-placement][Pod placement]]
   - [[file:core-concepts/10_pod_disruption_budget/][Pod disruption budgets]]
   - [[file:core-concepts/11_pod_topology_spread_constraints/][Pod Topology Spread Constraints]]

** [[file:advanced-concepts/][Advanced topics]]

   - [[file:advanced-concepts/01_building][Building images]]
   - [[file:advanced-concepts/02_sealed_secrets/][Sealed secrets]]
   - [[file:advanced-concepts/03_kustomize/][Kustomize]]
   - [[file:advanced-concepts/04_argocd][ArgoCD]]
